test/performance/benchmarks/func-invocation-ego-member/run/single-fun-enclave-samba-member/1500.log
2025/07/09 20:30:10 Function mode: SINGLE
2025/07/09 20:30:10 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1752093010.2485752,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/09 20:30:10 Starting func invocation probe for target: appender-ego-member
2025/07/09 20:30:10 Using rate: 1500
2025/07/09 20:35:37 Shutting down InfluxReporter
Requests      [total, rate, throughput]         319975, 1063.78, 421.83
Duration      [total, attack, wait]             5m27s, 5m1s, 25.996s
Latencies     [min, mean, 50, 90, 95, 99, max]  158.457µs, 33.781s, 33.845s, 1m5s, 1m20s, 1m50s, 3m8s
Bytes In      [total, mean]                     156297690, 488.47
Bytes Out     [total, mean]                     201885200, 630.94
Success       [ratio]                           43.08%
Status Codes  [code:count]                      0:136443  200:137849  502:20  503:45663  
Error Set:
503 Service Unavailable
502 Bad Gateway
Post "http://appender-ego-member.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
Post "http://appender-ego-member.default.svc.cluster.local": dial tcp 0.0.0.0:0->10.110.56.145:80: bind: address already in use
Post "http://appender-ego-member.default.svc.cluster.local": EOF
Post "http://appender-ego-member.default.svc.cluster.local": dial tcp 0.0.0.0:0->10.110.56.145:80: bind: address already in use (Client.Timeout exceeded while awaiting headers)
2025/07/09 20:35:37 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 1m19.782053109s